app/controllers/coderooms_controller.rb

SELECT "coderooms".* FROM "coderooms"
---
  def index
    @coderooms = Coderoom.all

SELECT  "coderooms".* FROM "coderooms" WHERE "coderooms"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    @coderoom = Coderoom.find(params[:id])