app/controllers/whiteboards_controller.rb

SELECT  "whiteboards".* FROM "whiteboards" WHERE "whiteboards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "whiteboards" SET "content" = $1, "updated_at" = $2 WHERE "whiteboards"."id" = $3  [["content", "this is going to worrealy wel excetitsnot wrkn sper eljd!"], ["updated_at", 2016-07-04 04:19:31 UTC], ["id", 1]]
---
  def update
    whiteboard = Whiteboard.find(params['id'])
    whiteboard.update_attributes content: params['content']